tutorials/channel3D_shear1500/constant/inputParameters
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
   This file contains all of the necessary input parameters used in clotFoam.
   All of the
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      inputParameters;
}

/* ------------------------------------------------------------------------- *\
   Geometry and Mesh Parameters
\*---------------------------------------------------------------------------*/
// Lengths of the rectangle (all in mm, don't forget a decimal!)
x_max 160.0e-03; // [mm] length of the channel (\ell) 
y_max 50.0e-03;  // [mm] height of the vessel (h) 
z_max 150.0e-3;  // [mm] width of the vessel (w)
l_inj 100.0e-03; // [mm] length of injury (x-dir)
w_inj 100.0e-03; // [mm] width of injury (z-dir)

// Mesh Grading Parameters
ds 2.0e-03; //smallest cell size (constant in injury channel)
Nx_up 10;
Nx_inj #calc "round($w_inj / $ds)";
Nx_down 8;
Nx #calc "$Nx_up + $Nx_inj + $Nx_down"; // # of x cells

Ny 18; // # of y cells
Nz 87;  // # of z of cells

Rx_up 0.5; // 10 cells in x-dir
Rx_inj 1; //50 cells in x-dir
Rx_down 3; // 8 cells in x-dir
Ry 3; // y-dir: highest cell is 2x larger than smallest cell.
Rz_back 0.4; //10 cells in z-dir
Rz_inj 1; // 67 cells in z-dir
Rz_front 2.5; //10 cells in z-dir

/* ------------------------------------------------------------------------- *\
   Fluid Parameters
\*---------------------------------------------------------------------------*/
nu 2.62507; // kinematic viscosity of fluid [mm^2 / s]
C_CK 1.0e+06; // Carman-Kozeny relation constant [1 / mm^2]
inletFlowRate 0.07435; //0.07435 ~1500 1/s; Q = w h^2 shear / 6 [mm^3 / s]
inletShearRate 1500; // inlet shear rate [1 / s]

/* ------------------------------------------------------------------------- *\
   Pressure Parameters (kinematic pressure)
\*---------------------------------------------------------------------------*/
Pv0 0.0; // outlet kinematic pressure [mm^2 / s^2]

/* ------------------------------------------------------------------------- *\
   Reaction time-step parameter
\*---------------------------------------------------------------------------*/
M_rxn 2; // Number of time steps for reactions solve: h_react = dt / M_react

/* ------------------------------------------------------------------------- *\
   Platelet Parameters
\*---------------------------------------------------------------------------*/
num_plts 7; // Total Number of platelet species (Integer)
num_plts_mobile 2; // Number of mobile platelet species (for transport solve)
Pdiam 3.0e-03; // Diameter of one platelet [mm]
Pmax 6.67e+07; // Maxiumum packing density [1 / mm^3]
Dp 2.5e-5; // Diffusion rate for platelets [mm^2 / s]
Plt_0 2.5e+05; // Mobile platelet inlet number density [1 / mm^3]
t0_Plt 0.1; // When the platelets start to enter the domain
tf_Plt 0.2; // When the platelets reach Plt_0 at inlet
thresholdTheta 1.0025; // Max allowed Theta_T before deltaT is refined

// Shear rates from experiments
lowShearRate 300.0; // [1 / s]
highShearRate 1500.0; // [1 / s]

// Platelet Adhesion Params
kAdhCol 3.3212e-08; // on-rate of adhesion via collagen [mm^3 / s]
kActCol 0.33; // Activation of Pseu to Psea by collagen [1 / s]
kAdhVwfOn300 2.9891e-08; // on-rate of adhesion via vWF [mm^3 / s]
kAdhVwfOn1500 8.7181e-08; // on-rate of adhesion via vWF [mm^3 / s]
kAdhVwfOff300 0.47; // off-rate of adhesion via vWF [1 / s]
kAdhVwfOff1500 1.6; // off-rate of adhesion via vWF [1 / s]

// Platelet Cohesion Params
kCohVwfOnPmax300 9000; // on-rate of cohesion via vWF [1/s]
kCohVwfOnPmax1500 18750; // on-rate of cohesion via vWF [1/s]
kCohVwfOff300 375; // // off-rate of cohesion via vWF [1/s]
kCohVwfOff1500 500; // // off-rate of cohesion via vWF [1/s]
kCohFbgOnPmax 5000; // on-rate of cohesion via Fibrinogen [1/s]

// Platelet Activation Params
kActVwf 0.34; // Platelet activation rate by shear on vWF [1/s]
kActADP 0.34; // Platelet activation rate by ADP [1/s]
ADP_ast 0.0001; // Critical concentration of ADP [nanomol / mm^3]
ADP_shift 1.0e-5; // right-shifting param. for Hill Funciton [nanomol / mm^3]
kActE2 0.5; // Platelet activation rate by thrombin [1/s]
E2_ast 1.0e-06; // Critical concentration of thrombin [nanomol / mm^3]
E2_shift 0; // right-shifting param. for Hill Funciton [nanomol / mm^3]

// Parameters for virtual substance eta
eta_t 0.1; // threshold value for g(eta) [dimless]
eta_ast 0.4; // eta_ast + eta_t = 0.25 - 0.75 [dimless]
l_D_eta #calc "2.0 * $Pdiam"; // length of "diffusion" for eta [mm]

// Parameters for shear-dependent activation of platelets by vWF
sAct_C 5000.0; // Critical shear rate for sAct [1/s]
sigmaAct 2.5; // Steepness parameter for sAct [dimless]

/* ------------------------------------------------------------------------- *\
   ADP Parameters
\* ------------------------------------------------------------------------- */
D_ADP 5.0e-04; // Diffusion rate for ADP [mm^2 / s]
ADP_rel 2e-08; // Total ADP released [nanomol/platlet]
sigma_dt 0.25; // How often the sigma_release function is calculated [s]
sigma_Tf 6; // How far back the integration goes for sigma_release [s]

/* ------------------------------------------------------------------------- *\
   Chemical Reaction Parameters
\*---------------------------------------------------------------------------*/
num_seBound 2; // Number of SE-bound chem. species (integer)
num_fluidPhase 4; // Number of fluid-phase chem. species (integer)
num_pltBound 6; // Number of platelet-bound chem. species (integer)

t0_chem $t0_Plt; // When the chemicals start to enter the domain
tf_chem $tf_Plt; // When the chemicals reach their full IC at inlet

// Avogadro's Constant
N_Avo 6.02214076e+14; // [1 / nanomol]

// Diffusion rate for fluidPhase chemicals
Dc 5.0e-05; // [mm^2/s]

// Initial concentrations
E0_IC 1.5e-07; // Concentration of TF:VIIa on SE Wall [nanomol / mm^2]
S1_IC 1.7e-04; // Concentration of X at inlet [nanomol / mm^3]
S2_IC 1.4e-03; // Concentration of II at inlet [nanomol / mm^3]

// Number of binding sites on platelet surface for specific chems
N_1 2700.0;
N_2 2000.0;

// Kinetic Rates
kC0_on 8.95e+03; // On-rate for C0 [mm^3 / nanomol / s]
kC0_off 1.0; // Off-rate for C0 [1/s]
kC0_cat 1.15; // Cat-rate for C0 [1/s]

kC1_on 1.03e+05; // On-rate for C1 [mm^3 / nanomol / s]
kC1_off 1.0; // Off-rate for C1 [1/s]
kC1_cat 30; // Cat-rate for C1 [1/s]

kC2_on 1.73e+04; //  On-rate for C2 [mm^3 / nanomol / s]
kC2_off 1.0;     // Off-rate for C2 [1/s]
kC2_cat 0.23;    // Cat-rate for C2 [1/s]

kE1_on 1.0e+04;  //  On-rate for Xa [mm^3 / nanomol / s]
kE1_off 2.5e-02; // Off-rate for Xa [1/s]

kE2_on 1.0e+04;  //  On-rate for IIa [mm^3 / nanomol / s]
kE2_off 5.9; // Off-rate for IIa [1/s]

kS1_on 5.7e+04; // On-rate for FV [mm^3 / nanomol / s]
kS1_off 0.17; // Off-rate for FV [1/s]

kS2_on 1.0e+04; // On-rate for II [mm^3 / nanomol / s]
kS2_off 5.9; // Off-rate for II [1/s]

/* ------------------------------------------------------------------------- *\
   Other lengths used by multiple files (DON'T EDIT!!!!!)
\*---------------------------------------------------------------------------*/
// Define the left and right edges of the adhesion region
l_edge_Adh #calc "($x_max-$l_inj)/2.0";
r_edge_Adh #calc "($x_max+$l_inj)/2.0";
back_edge_Adh #calc "($z_max-$w_inj)/2.0";
front_edge_Adh #calc "($z_max+$w_inj)/2.0";

// ************************************************************************* //
