tutorials/channel3D_shear1500/0/plt_Pmu
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      plt_Pmu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "$FOAM_CASE/constant/inputParameters"
    
    /*
    inletVessel
    {
        type         uniformFixedValue;
        uniformValue
        {
            type             scale;
            scale            linearRamp;
            start            $t0_chem;
            duration         $tf_chem;
            value            $Plt_0;
        }
    }
    */
    
    inletVessel
    {
        type            codedFixedValue;
        value           uniform 0;
        name            Pmu_nearWallProfile;

        code
        #{
            /*
             Near-wall excess platelet profile motivated by Eckstein 1991
             Pmu = Plt_0 * C0 * s(y,z), 
             where s(y,z) = 1 + K*Ry(y)^18 * (1 - Ry(y))
                            + K*Rz(z)^18 * (1 - Rz(z))
                   Ry(y) = abs(y - y0 - ry) / ry , 
                      ry = radius of vessel in y-dir: h_chan/2,
                   Rz(z) = abs(z - z0 - rz) / rz , 
                      rz = radius of vessel in z-dir: w_chan/2,
                   1/C0 = 1 / A * integral( s(y,z)*dA ),
                      A = area of inlet: w_chan * h_chan
                      K : determines amplitude of shape
             ** Code has been written for serial and parallel runs **
            */

            scalar Ky = 4.55e+02; // for ampilitude of profile
            scalar Kz = 3.5524e+02; // for ampilitude of profile
            scalar Max_S = 10.034713485642886; // maximum allowed S value

            // Get position vector and initialize s field
            const vectorField& Cf = patch().Cf(); // value a face center
            scalarField s (patch().size(), 0.); // field for storing shape s(x,z)

            // Normal concentration of platelets at inlet  
            const scalar Plt_0 = readScalar
            (
                db().lookupObject<IOdictionary>
                (
                    "inputParameters"
                ).lookup("Plt_0")
            );

            // Height of the vertical channel
            const scalar h_chan = readScalar
            (
                db().lookupObject<IOdictionary>
                (
                    "inputParameters"
                ).lookup("y_max")
            );

            // width of the vertical channel
            const scalar w_chan = readScalar
            (
                db().lookupObject<IOdictionary>
                (
                    "inputParameters"
                ).lookup("z_max")
            );

            // Other necessary values
            scalar ry = h_chan/2.; // radius in y-direction
            scalar rz = w_chan/2.; // radius in z-direction

            // Get initial shape of profile
            forAll(Cf,faceI)
            {
                scalar y = Cf[faceI][1];
                scalar z = Cf[faceI][2];
                scalar Ry = std::abs(y - ry) / ry; 
                scalar Rz = std::abs(z - rz) / rz; 
                s[faceI] = 1. + Ky * pow( Ry, 18) * (1 - Ry)
                              + Kz * pow( Rz, 18) * (1 - Rz);
                
                // Exclude extrema in corners
                if (s[faceI] > Max_S)
                {
                    s[faceI] = Max_S;
                }
            }

            //--- Integrate the profile with midpoint rule
            // Face area magnitude magSf = dx*dz 
            const scalarField dA = patch().magSf(); 
            scalar intgrl_s = 0.;
            forAll(s,k)
            {
                intgrl_s = intgrl_s + dA[k] * s[k];
            }

            // If parallel run, must sum all local intgrl_s values
            if (Pstream::nProcs() > 1) 
            {
                reduce(intgrl_s, sumOp<scalar>()); 
            }

            // Set the field values at the inlet
            scalar C0 = h_chan * w_chan / intgrl_s;
            operator == (Plt_0 * C0 * s); 

            /*
            // check that the integral of the profile = integral Plt_0
            scalar intconst = Plt_0 * h_chan * w_chan;
            scalar intgrl_profile = 0;
            forAll(s,k)
            {
                intgrl_profile = intgrl_profile + dA[k] * Plt_0 * C0 * s[k];
            }
            Info << "intconst = " << intconst << endl;
            Info << "intgrl_profile = " << intgrl_profile << endl;
            */

        #};
    }

    outletVessel
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
    
    injuryWalls
    {
        type            zeroGradient;
    }
    
    frontBack
    {
        type            empty;
    }
}

// ************************************************************************* //
