tutorials/channel3D_shear1500/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/constant/inputParameters"
min_Dxyz #calc "0.1*$Pdiam";

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box 
            (
                #calc "$l_edge_Adh - $min_Dxyz" 
                #calc "-1.0*$min_Dxyz" 
                #calc "$back_edge_Adh - $min_Dxyz"
            ) 
            (
                #calc "$r_edge_Adh + $min_Dxyz" 
                $min_Dxyz 
                #calc "$front_edge_Adh + $min_Dxyz"
            );
        }
    }
);

// ************************************************************************* //
